import sqlite3

connection = sqlite3.connect("database.db")
cursor = connection.cursor()

cursor.execute("""
CREATE TABLE IF NOT EXISTS Classes (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS Weapon (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    class_id INTEGER NOT NULL,
    weapon_name TEXT NOT NULL,
    damage INTEGER NOT NULL,
    stage INTEGER NOT NULL,
    info TEXT NOT NULL,
    FOREIGN KEY (class_id) REFERENCES Classes (id)
)
""")

classes = [
    ('Melee',),
    ('Magic',),
    ('Ranger',),
    ('Summoner',),
]

cursor.executemany("INSERT INTO Classes (name) VALUES (?)", classes)

weapons = [
    # Melee weapons
    (1, 'Дерев\'яний Меч (Wooden Sword)', 7, 0, '''Дерев’яний меч — це перша зброя, з якою починається шлях більшості гравців у Terraria. Він легко виготовляється з 7 одиниць деревини на звичайному верстаку. Незважаючи на свою простоту, цей меч вже має одну важливу перевагу: широке розмахування замість прямого колючого удару, що робить його кориснішим за стартовий короткий меч. Його базова шкода становить 7 одиниць, а критичний шанс — 4%, що типово для більшості звичайної зброї у Pre-Hardmode. Він має швидку швидкість атаки, але дуже слабкий нокбєк, що ускладнює стримування ворогів. Цей меч не підтримує автоатаку, тому гравцю доведеться натискати клавішу атаки вручну.

Найкращою перековкою для нього є Legendary, яка значно покращує показники: на 15% зростає шкода, на 5% підвищується критичний шанс, на 10% зростає швидкість атаки, нокбєк стає сильнішим на 15%, а також збільшується розмір меча на 10%. Ці покращення роблять навіть таку просту зброю набагато ефективнішою на початку гри.'''),
    (1, 'Золотий Меч (Gold Broadsword)', 13, 0, '''Золотий меч — наступний логічний крок після дерев’яного. Він виготовляється з 8 золотих злитків, які можна знайти в шахтах. Його шкода становить 13 одиниць, а критичний шанс — 4%, як і в попереднього. Швидкість атаки є середньою, а нокбєк — помірним, що робить його кращим варіантом для захисту на перших етапах дослідження світу. Автоатаки він не має, тому гравцю доведеться продовжувати натискати для кожного удару.

І тут також найкращим варіантом перековки буде Legendary. Застосування цієї перековки дозволяє підняти бойові характеристики: шкода збільшується на 15%, критичний шанс на 5%, швидкість на 10%, нокбєк на 15%, і ще на 10% зростає розмір меча, що особливо важливо для ближнього бою.'''),
    (1, 'Платиновий Меч (Platinum Broadsword)', 15, 0, '''Платиновий меч є вищим аналогом золотого та створюється з 8 платинових злитків. Якщо гравцеві пощастило з генерацією світу, і в ньому присутня платина замість золота, цей меч стане найкращим варіантом на ранніх етапах. Його шкода дорівнює 15, критичний шанс — 4%, а швидкість атаки залишається середньою, із помірним нокбєком. Автоатаки немає, але за рахунок вищої базової шкоди він забезпечує відчутну перевагу.

Як і раніше, перековка Legendary є найефективнішою: вона додає 15% до шкоди, 5% до критичного шансу, 10% до швидкості, 15% до нокбєку, і 10% до розміру меча, роблячи його потужним інструментом для очищення печер і захисту від перших загроз.'''),
    (1, 'Кривавий М\'ясник (Blood Butcherer)', 22, 1, '''Цей меч є першим серйозним апгрейдом після вбивства Ока Ктулху, за умови, що світ гравця має Кримзон замість Корупції. Виготовляється він з 10 Crimtane Bars і має базову шкоду 22, повільну швидкість, сильний нокбєк, а критичний шанс — 4%. Відзначається довжиною та вражаючою здатністю зупиняти ворогів, що наближаються. Автоатаки не має, але її компенсує сила удару.

Перековка Legendary збільшує його шкоду, додаючи +15%, піднімає критичний шанс на 5%, прискорює атаки на 10%, підсилює нокбєк на 15%, і також робить лезо на 10% довшим, що критично важливо у ближньому бою.'''),
    (1, 'Блискучий Клинок (Phaseblade)', 20, 1, '''Цей меч — не просто зброя, а й прикраса арсеналу. Створюється з 20 метеоритних злитків і 1 дорогоцінного каменя, що визначає його колір. Його базова шкода становить 20, швидкість атаки — дуже висока, нокбєк слабкий, критичний шанс — 4%, і що найголовніше — він підтримує автоатаку, дозволяючи атакувати безперервно.

Хоча технічно перековка Legendary не завжди застосовується до цього типу зброї, якщо вона доступна, це найкращий варіант: +15% до шкоди, +5% криту, +10% до швидкості, +15% нокбєку, +10% розміру. У разі недоступності — альтернативна перековка Godly або Demonic (без бонусу до розміру) також буде дуже ефективною.'''),
    (1, 'Вогняний Великий Меч (Fiery Greatsword)', 36, 2, '''Fiery Greatsword — це справжній гігант серед мечів Pre-Hardmode. Його створення потребує 20 Hellstone Bars, які можна виплавити, комбінуючи Obsidian та Hellstone — ресурси, що видобуваються лише в глибинах Пекла. Цей меч має значну базову шкоду — 36 одиниць, що вже само по собі вражає на цьому етапі гри. Його критичний шанс становить 4%, а швидкість атаки — повільна. Натомість він має дуже сильний нокбєк і, що важливо, підпалює ворогів, завдаючи додаткової шкоди протягом часу. Автоатака відсутня, але потужність кожного замаху компенсує цю відсутність.

Цей меч не лише сам по собі ефективний, а й є обов’язковим компонентом для створення легендарного меча Night’s Edge. Однак навіть до цього він заслуговує на перековку Legendary, яка ще більше підвищує його потенціал: +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, +15% до нокбєку, і +10% до розміру меча. Завдяки такому бусту цей меч стає справжнім громовержцем у будь-якому бою з босами чи великими групами ворогів.'''),
    (1, 'Клинок Ночі (Night\'s Edge)', 42, 2, '''Night’s Edge — це символ могутності Pre-Hardmode. Щоб створити його, потрібно об'єднати чотири потужні мечі: Fiery Greatsword, Blade of Grass, Muramasa, а також Blood Butcherer або Light’s Bane (залежно від світу). Результатом стане меч, який поєднує в собі силу кожного з компонентів. Його базова шкода — 42 одиниці, швидкість — середня, нокбєк — сильний, а критичний шанс — 4%. Меч має величезний розмір і завдає шкоди по широкій дузі, що робить його ідеальним проти великих груп ворогів або босів із кількома частинами. Автоатаки не має, проте кожен замах відчутно впливає на результат бою.

Перековка Legendary тут не просто бажана — вона необхідна. З її допомогою меч отримує +15% шкоди, +5% криту, +10% швидкості атаки, +15% нокбєку, і +10% розміру, що значно підсилює його загальний потенціал. Для більшості гравців саме Night’s Edge стане головною зброєю до початку режиму Hardmode.'''),
    (1, 'Ломатель Клинків (Breaker Blade)', 39, 2, '''Breaker Blade — це особлива зброя, яка випадає з фінального босу Pre-Hardmode — Стінки Плоті (Wall of Flesh). Його особливість полягає в тому, що це найбільший меч у грі на даному етапі, і його перша атака по кожному ворогу, який має 100% здоров’я, завдає подвійну шкоду. Базова шкода становить 39 одиниць, швидкість атаки — дуже повільна, нокбєк — надзвичайно сильний, а критичний шанс — 4%. Завдяки величезному розміру він легко вражає кількох ворогів одночасно, особливо в тісних просторах. Автоатака, на жаль, відсутня.

Найкраща перековка — знову ж таки Legendary, яка компенсує повільність, додаючи +15% шкоди, +5% до критичного шансу, +10% швидкості атаки, +15% нокбєку, і +10% до розміру меча. У підсумку, Breaker Blade стає неймовірно потужною зброєю, яка може знищувати ворогів ще до того, як вони зможуть завдати шкоди гравцеві.'''),

    # Magic weapons
    (2, 'Паличка Іскор (Wand of Sparking)', 14, 0, '''Паличка Іскор — це перший крок для кожного мага, який бажає поринути у світ чарів і магічних дуелей. Вона вважається одним з основних інструментів на початку гри, і хоч її вигляд досить скромний, вона несе в собі магію, що здатна змінити хід битви. Для її створення необхідно всього лише кілька елементів: дерево і факел. Здавалося б, прості матеріали, але їх поєднання створює зброю, яка випромінює перші іскри магії в руках новачка.

Загальна шкода цієї палички становить 14 одиниць, що вже на самому початку є значним показником, якщо порівняти з іншими інструментами. Однак, її критичний шанс становить 4%, що надає їй більше шансів на потужніший ефект при кожному влученні. Кожен постріл палички коштує лише 2 мани, що робить її не лише доступною, а й економічно вигідною для постійного використання.

Попри свою простоту, ця зброя має одну важливу особливість — вона може підпалювати ворогів, завдаючи їм додаткову шкоду протягом кількох секунд. Для більшості перших ворогів це здатне стати вирішальним фактором, бо навіть прості іскри можуть значно зменшити здоров’я супротивника, поки він намагається вирватися з полум'я.

Паличка Іскор є чудовим стартом для кожного мага, однак її справжній потенціал розкривається лише після перековки. Перековка на Mythical — це оптимальний вибір для цієї зброї, і ось чому. Вона додає +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, -8% до витрат мани, і -10% до затримки між пострілами. З такими оновленнями, паличка стає набагато більш потужною, завдаючи високої шкоди і забезпечуючи стабільне використання навіть під час тривалих боїв.

З цим посохом новачок стає більш впевненим у своїх силах, і йому відкриваються нові горизонти в магічному мистецтві. Це лише перша ланка в ланцюгу могутніх артефактів, які чекають попереду, але вже з цією паличкою можна сміливо пробиватися через безліч ворогів.'''),
    (2, 'Рубіновий Посох (Ruby Staff)', 21, 0, '''Рубіновий Посох — це наступна важлива стадія розвитку магічних сил. Його можна виготовити, використовуючи вісім золотих злитків і один рубін, який необхідно знайти глибоко в підземеллях, де ховаються камені, що блищать в темряві. Цей посох ставить магів на новий рівень, адже його базова шкода становить 21 одиницю, що вже дає суттєву перевагу перед початковими знаряддями. Вартість кожного пострілу складає 5 мани, що вимагає обережного ставлення до ресурсів, але в цілому дозволяє маніпулювати потужними атаками без особливих проблем.

Цей посох має 4% шанс на критичний удар, що дозволяє отримати додаткову шкоду при певних удачах, і його постріл направляється точно по напрямку до курсору, що робить атаку надзвичайно точною. Він також має помірну швидкість атаки, що дозволяє здійснювати рівні та точні удари по ворогах, навіть якщо їх більше ніж один.

Але для того, щоб розкрити весь його потенціал, магам слід зробити перековку на Mythical. Ця перековка дає істотні бонуси: +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, -8% до витрат мани та -10% до затримки між пострілами. У результаті, Рубіновий Посох стає не лише потужною зброєю, а й надійним інструментом для безперервних атак, з яким можна успішно боротися з більш складними ворогами.

Всі ці характеристики дозволяють цьому посоху стати важливим етапом у розвитку будь-якого мага, і він підготував гравця до серйозніших боїв з босами та іншими магічними перешкодами. Це вже не просто стартова зброя, а потужний артефакт, здатний забезпечити магу перемогу на ранніх етапах гри.'''),
    (2, 'Бурштиновий Посох (Amber Staff)', 23, 0, '''Бурштиновий Посох — це наступна магічна зброя, яка ідеально підходить для гравців, що вже досить освоїли основи магії та хочуть вийти на новий рівень у своїх закляттях. Щоб створити цей посох, необхідно знайти вісім золотих злитків та один бурштин, дорогоцінний камінь, що ховається в надрах Підземелля. Бурштиновий Посох вражає своєю елегантністю: його енергія передається у вигляді гарячих вогняних променів, здатних завдавати серйозної шкоди навіть сильним противникам.

Шкода цього посоха становить 23 одиниці, що є суттєвим кроком вперед у порівнянні з попередніми магічними інструментами. Кожен постріл витрачає 6 мани, що вимагає більшу уважність до управління ресурсами, але натомість ви отримуєте відмінну магічну потужність. Посох також володіє 4% шансом на критичний удар, що дає змогу завдати серйозної шкоди при вдалій удачі.

Швидкість пострілів помірна, а сама атака виконується чітко по лінії курсора, що робить цей посох точним та ефективним в боротьбі як з малими, так і з великими ворогами. Бурштиновий Посох відмінно підходить для використання в бою з групами ворогів, оскільки його снаряди можуть пробивати кілька цілей, завдаючи їм значної шкоди. Додатково, вогняні промені мають шанс підпалювати ворогів, що є дуже корисним для боротьби з більш витривалими супротивниками.

Перековка цього посоха на Mythical стане найбільш ефективним вибором, оскільки вона дозволяє посоху розкрити свій повний потенціал. З Mythical посох отримує +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, -8% до витрат мани, і -10% до затримки між пострілами. Це забезпечує більшу ефективність у всіх аспектах гри, від підвищення шкоди до покращення швидкості пострілів і зниження витрат мани. З таким посохом маг здатен ефективно протистояти більш складним ворогам і пройти далі в магічному розвитку.

Таким чином, Бурштиновий Посох стане важливим інструментом для всіх магів на шляху до більш потужних артефактів, відчиняючи двері до наступних етапів і розширюючи магічний арсенал.'''),
    (2, 'Магічна Ракета (Magic Missile)', 27, 1, '''Магічна Ракета — це перша справжня демонстрація сили арканічних заклять після простих початкових інструментів. Виготовлена після першого босу — Очі Ктулху, ця зброя дає магу відчуття справжньої магічної влади. Для її створення потрібно зібрати дев’ять сірчаних злитків і одну сяючу зірку, яку можна знайти у нічних небесах після перемоги над боссом. Магічна Ракета вражає своєю неперевершеною точністю: вона буквально розриває повітря, залишаючи за собою слід яскравих спалахів.

Ця зброя завдає 27 одиниць магічної шкоди за постріл, що вже є значною силою для середини гри, і має 6% шанс на критичний удар, що дає чудовий потенціал для потужних атак. 5 мани витрачаються з кожним пострілом, що робить її порівняно економною, проте з цією шкодою вона вже стає потужним знаряддям для швидких атак по сильних ворогах. Швидкість пострілів стандартна, але точність ракети вражає, вона завжди летить чітко по напрямку до ворога, що дозволяє безпомилково вражати ціль навіть на великій відстані.

Перековка на Mythical — це необхідний крок для цієї зброї, оскільки з підвищенням на Mythical вона набирає справжнього масштабу. Після перековки шкода збільшується на 15%, що робить її ще більш небезпечною, критичний шанс збільшується на 5%, а також швидкість атаки підвищується на 10%, що дозволяє запускати більше ракет за менший час. Крім того, витрати мани знижуються на 8%, а час між пострілами скорочується на 10%, що дозволяє підтримувати постійну атаку на ворогів, навіть якщо їх багато. Ці покращення роблять Магічну Ракету ідеальним вибором для тих, хто хоче мати потужну зброю для атак на великих відстанях.'''),
    (2, 'Полум\'яний Батіг (Flamelash)', 40, 1, '''Полум'яний Батіг — одна з найефективніших магічних зброї після першої серйозної битви з босом, ідеальна для контролю великих територій. Він виготовляється з вісімнадцяти сірчаних злитків та однієї сяючої зірки. Вогняний батіг випромінює гаряче полум'я, яке обвиває ворогів і спалює їх на всіх етапах бою. Цей магічний артефакт має 40 одиниць шкоди, що робить його потужним зброєю, здатним знищувати навіть сильних супротивників. З 5% шансом на критичний удар він стає не тільки потужним інструментом, але й дуже небезпечним, якщо поєднати його з хорошими тактичними діями.

Вартість пострілу складає 8 ман, що є помітним витратним фактором, але можливість підпалити ворогів робить кожну атаку неймовірно ефективною. Вогонь, що лишається після удару, ще довго продовжує завдавати шкоди ворогу, що дозволяє довести бій до логічної перемоги, навіть якщо самі вороги намагаються втекти або заховатися. У комбінації з перековкою Mythical Полум'яний Батіг здобуває істотні переваги: +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, -8% до витрат мани та -10% до затримки між пострілами.

Ці бонуси перетворюють цей артефакт на смертоносний інструмент, здатний не тільки знищувати супротивників, а й контролювати великі території, підпалюючи все на своєму шляху.'''),
    (2, 'Демонічна Коса (Demon Scythe)', 35, 2, '''Демонічна Коса — це жахливий інструмент смерті, створений з потужною темною магією. Для її виготовлення потрібно зібрати десять демонічних злитків і десять сірчаних злитків, що робить цей посох важким для отримання, але настільки ж потужним після того, як його створити. У руках досвідченого мага Демонічна Коса стає важливим етапом у розвитку сил. Вона завдає 35 одиниць магічної шкоди за постріл, має 8% шанс на критичний удар, що дає їй чудовий потенціал для завдання великої шкоди при кожній удачі.

Кожен постріл коштує 6 мани, що робить її економічною ідеєю для використання навіть на довгих етапах боїв, адже кожен постріл — це прямий шлях до перемоги. Завдяки повільній швидкості пострілів, цей посох дає чіткі й важкі удари, що гарантовано вражають ворога навіть на великій відстані. Коли її перековують на Mythical, зброя набуває нових масштабів: +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, -8% до витрат мани та -10% до затримки між пострілами. Це дозволяє зробити косу не лише потужною, а й значно ефективнішою у всіх аспектах, від точності до швидкості використання.'''),
    (2, 'Кришталевий Шторм (Crystal Storm)', 42, 2, '''Кришталевий Шторм — це абсолютно небезпечна зброя, яку маг може отримати після перемоги над босом в корупційних або кривавих біомах. Виготовляється цей посох з десяти кришталевих снарядів та десяти сірчаних злитків, що робить його потужним, але дуже складним для виготовлення. Кришталевий Шторм є однією з найпотужніших магічних зброї для масових атак, адже її снаряди стріляють одночасно по кількох ворогах і завдають 42 одиниць шкоди за кожен потраплений постріл.

З 8% шансом на критичний удар цей посох стає ідеальним вибором для тих, хто хоче боротися з великими групами ворогів. 8 мани витрачаються на кожен постріл, але за цю високу ціну ви отримуєте ефективність, здатну пробивати навіть важких противників.

З перековкою Mythical цей посох досягає свого піку: +15% до шкоди, +5% до критичного шансу, +10% до швидкості атаки, -8% до витрат мани та -10% до затримки між пострілами. З такими покращеннями Кришталевий Шторм стає потужним артефактом, здатним завдавати серйозної шкоди величезним групам ворогів та ефективно знищувати навіть босів.'''),
    (2, 'Прокляті Полум\'я (Cursed Flames)', 44, 2, ''''''),

    # Ranger weapons
    (3, 'Дерев\'яний Лук (Wooden Bow)', 4, 0, ''''''),
    (3, 'Залізний Лук (Iron Bow)', 10, 0, ''''''),
    (3, 'Золотий Лук (Gold Bow)', 13, 0, ''''''),
    (3, 'Демонічний Лук (Demon Bow)', 17, 1, ''''''),
    (3, 'Сухожильний Лук (Tendon Bow)', 19, 1, ''''''),
    (3, 'Розплавлена Лють (Molten Fury)', 31, 2, ''''''),
    (3, 'Бджолиний Лук (Bee\'s Knees)', 23, 2, ''''''),
    (3, 'Пекельний Лук (Hellwing Bow)', 28, 2, ''''''),

    # Summoner weapons
    (4, 'Посох Слизу (Slime Staff)', 8, 0, ''''''),
    (4, 'Посох Фінча (Finch Staff)', 7, 0, ''''''),
    (4, 'Посох Флінкса (Flinx Staff)', 12, 0, ''''''),
    (4, 'Посох Імпа (Imp Staff)', 21, 1, ''''''),
    (4, 'Посох Шершня (Hornet Staff)', 18, 1, ''''''),
    (4, 'Посох Павука (Spider Staff)', 26, 2, ''''''),
    (4, 'Кривавий Посох (Blood Staff)', 35, 2, ''''''),
    (4, 'Посох Леза (Blade Staff)', 38, 2, ''''''),
]

def populate_tables(cursor):
    cursor.executemany("INSERT INTO Classes (name) VALUES (?)", classes)
    cursor.executemany("INSERT INTO Weapon (class_id, weapon_name, damage, stage, info) VALUES (?, ?, ?, ?, ?)", weapons)

populate_tables(cursor)
connection.commit()
connection.close()